<template>
    <div class="recipes">
        <h3 class="recipes__header">Важно!!!</h3>
        <p class="recipes__text">В разработке этого приложения не принимали участие дизайнеры, тестировщики и другие специалисты, а весь код написан мною лично. Я не дизайнер и не стремлюсь им стать, по этому прошу не оценивать внешний вид, а обратить внимание на реализованный функционал.</p>
        <p class="recipes__text">
            Проект хранится на GitHub и доступен по ссылкам:<br/>
            Клиент: https://github.com/AlexS342/my_cooking_vue<br/>
            Сервер: https://github.com/AlexS342/my_cooking_laravel
        </p>

        <h3 class="recipes__header">Об ответственности разработчика.</h3>
        <p class="recipes__text">Приложение разрабатывается с целью развития личных навыков программирования и может наполняться вымышленной информацией, не являющейся актуальной и не рекомендуется к применению. Запрещается готовить пищу по рецептам, которые добавил разработчик для тестирования приложения. Последствия на вашей совести и под вашей ответственностью.</p>
        <p class="recipes__text">Приложение не является коммерческим, а находится в стадии разработки и разработчик не может гарантировать сохранности ваших личных данных, поэтом не рекомендуется хранить то, что имеет какую-то ценность или невозможно восстановить в случае утраты. Так же следует понимать, то что приложение находится в стадии разработки, а значит разработчик не может гарантировать полноценной защиты ваших личных данных от хищения злоумышленниками.</p>
        <p class="recipes__text">Разработчик не несет ответственности за рецепты и информацию в рецептах, добавленную другими пользователями.</p>
        <p class="recipes__text">Пользователь самостоятельно несет ответственность за добавленную информацию в соответствии с законодательством Российской Федерации.</p>
        <p class="recipes__text">Если все упростить, то разработчик ни за что не отвечает, пользователь сохранивший рецепт отвечает за рецепт, а тот, кто решил приготовить по чужому рецепту, сам виноват. Не добавляйте то, что не законно и готовьте по своим рецептам, тогда всем будет проще.</p>

        <h3 class="recipes__header">О приложении</h3>
        <p class="recipes__text">Клиент реализован на Vue.js. Для удобства разработки используются однофайловые компоненты. Для выполнения запросов API используется библиотека axios. Для передачи данных между компонентами используется Vuex.js.</p>
        <p class="recipes__text">Серверная часть приложения реализована на Laravel 10. Аутентификация реализована на Fortify и Sanctum. Взаимодействие с клиентом через REST API, проверка входящих данных форм через Request, запросы к базе данных построены на ORM, построение таблиц базы данных реализовано через миграции</p>
        <p class="recipes__text">В проекте используется PostgreSQL запущенная в Docker. Для удобства написан файл docker-compose.yml</p>
        <p class="recipes__text">Хостинг - Ubuntu, NGINX, PHP-FPM</p>
        <p class="recipes__text">В настоящий момент приложение проходит стадию MVP и выполняет только основной функционал, требующий доработки. Я посвящаю разработке все свое свободное время и надеюсь, что вы сможете воспользоваться всем функционалом.</p>
        <p class="recipes__text">В приложении поставлена цель дать возможность пользователю хранить рецепты блюд в доступном месте и всегда иметь к ним доступ. Кроме того, любой пользователь может просматривать все рецепты, сохраненные в приложении. А отличительной особенностью является помощь в приготовлении рецепта.</p>
<!--        <p class="recipes__text"></p>-->
<!--        <p class="recipes__text"></p>-->

    </div>
</template>

<script>
// @ является псевдонимом для /src
// import BrieflyRecipe from '@/components/BrieflyRecipe.vue'
import axios from "axios";
export default {
    name: 'AboutView',
    components: {
    },
    data() {
        return {
            data:"",
        }
    },
    created() {
    },
    methods:{
    }
}
</script>

<style scoped lang="scss">
.recipes{
    width: 100%;
    max-width: 800px;
    margin: 0 auto;
    display: flex;
    flex-direction: column;
    flex-grow: 1;
    align-items: center;
}
.recipes__header{
    color: #4d4d4d;
    margin-top: 12px;
    text-transform: uppercase;
    padding: 12px;
    text-align: center;
    box-sizing: border-box;
}
.recipes__text{
    width: 100%;
    max-width: 800px;
    margin: 0 auto;
    color: #4d4d4d;
    padding: 6px 12px;
    text-align: start;
    font-weight: 300;
    line-height: 20px;
    box-sizing: border-box;
}

</style>